tap "homebrew/cask"

# Terminal
cask "iterm2"
brew "zinit"

# IDE
cask "visual-studio-code"

# Core functions
brew "coreutils"
brew "fzf"
brew "autojump"
brew "tree"
brew "gnu-sed"
brew "telnet"
brew "expect"
brew "gpg"

# Dev tools
cask "kaleidoscope"
brew "yq"
brew "jq"
brew "bat"
brew "kafkacat"
brew "k6"
brew "dive"
brew "docker"
brew "docker-compose"

# Dev tools management
brew "asdf"

# Environment management
brew "direnv"

# Source code management
brew "git"
brew "git-crypt"

# Utilities
brew "wireshark"
brew "mitmproxy"
brew "no-more-secrets"
brew "nnn"
brew "openvpn"
cask "1password"
brew "1password-cli"

# Kubernetes tools
brew "k9s"
brew "k3d"
brew "stern"
brew "kubectx"

# Cloud tools
brew "azure-cli"
brew "awscli"