tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "thecasualcoder/stable"
tap "hakky54/crip"
tap "weaveworks/tap"
tap "nats-io/nats-tools"
tap "vmware-tanzu/carvel"

# Terminal
cask "iterm2"
brew "zinit"
cask "font-hack-nerd-font"
brew "starship"

# IDE
cask "visual-studio-code"
cask "intellij-idea"
cask "goland"

# Core functions
brew "coreutils"
brew "tmux"
brew "fzf"
brew "autojump"
brew "tree"
brew "gnu-sed"
brew "telnet"
brew "expect"
brew "gpg"
brew "netcat"
brew "watch"
brew "gzip"
brew "wget"

# Communication tools
cask "slack"
cask "microsoft-teams"

# Dev tools
cask "kaleidoscope"
brew "yq"
brew "jq"
brew "bat"
brew "exa"
brew "kafkacat"
brew "k6"
brew "dive"
cask "docker"
cask "insomnia"
brew "ansible"
cask "crip"
brew "nats-io/nats-tools/nats"
brew "datawire/blackbird/telepresence-arm64"
brew "terraform-docs"
brew "ytt"

# Source code management
brew "git"
brew "git-crypt"

# Utilities
brew "mas"
cask "coteditor"
brew "wireshark"
brew "mitmproxy"
brew "no-more-secrets"
brew "nnn"
brew "openvpn"
cask "1password-cli"
cask "spotify"
cask "kindle"
brew "gnupg"
brew "pinentry-mac"
brew "slides"

# Kubernetes tools
brew "k9s"
brew "k3d"
brew "stern"
brew "kubectx"
cask "kui"
brew "krew"
brew "kube-fzf"
brew "vendir"
brew "kapp"
brew "imgpkg"


# Cloud tools
brew "azure-cli"
brew "awscli"
brew "aws-iam-authenticator"
brew "doctl"
brew "weaveworks/tap/eksctl"
cask "google-cloud-sdk"